##Pandas##

In [1]:
 #Pandas library is a powerful tool for data manipulation and analysis in Python
 #A one-dimensional labeled array capable of holding any data type-Series
 import pandas as pd

# Creating a Series
s = pd.Series([1, 3, 5, 6, 8])
print(s)

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [2]:
#DataFrame- two-dimensional labeled data structure with columns of potentially different types.
# Creating a DataFrame
data = {'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8]}
df = pd.DataFrame(data)
print(df)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

##Creation##

In [ ]:

# pd.DataFrame(data): Create a DataFrame.
# pd.read_csv(filepath): Read a CSV file into a DataFrame.
# pd.read_excel(filepath): Read an Excel file into a DataFrame.
# pd.read_sql(query, connection): Read a SQL query or database table into a DataFrame.
# pd.read_json(json_string): Read a JSON string into a DataFrame.

##DataFrame Inspection Methods##

In [3]:
import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Edward'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 45000, 60000, 75000]
}
df = pd.DataFrame(data)

# Return the first 3 rows
print("Head (first 3 rows):")
print(df.head(3))

# Return the last 2 rows
print("\nTail (last 2 rows):")
print(df.tail(2))

# Print concise summary
print("\nInfo:")
print(df.info())

# Generate descriptive statistics
print("\nDescribe:")
print(df.describe())

# Return the data types of the DataFrame columns
print("\nData Types:")
print(df.dtypes)

# Return the dimensions of the DataFrame
print("\nShape:")
print(df.shape)

Head (first 3 rows):
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   45000

Tail (last 2 rows):
     Name  Age     City  Salary
3   David   32  Houston   60000
4  Edward   29  Phoenix   75000

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes
None

Describe:
             Age        Salary
count   5.000000      5.000000
mean   26.800000  66000.000000
std     3.962323  13874.436926
min    22.000000  45000.000000
25%    24.000000  60000.000000
50%    27.000000  70000.000000
75%    29.000000  75000.000000
max    32.000000  80000.000000

Data Types:
Name      object
Age        int64
City      object
Salary     int64
dtype: object

Shape:
(5, 4)

##Selection Methods##

In [4]:
# Select a column
print("\nSelect 'Name' column:")
print(df['Name'])

# Select multiple columns
print("\nSelect 'Name' and 'City' columns:")
print(df[['Name', 'City']])

# Select by index
print("\nSelect row at index 2 using iloc:")
print(df.iloc[2])

# Select by label
print("\nSelect row with label 2 using loc:")
print(df.loc[2])

# Filter rows based on column values
print("\nFilter rows where 'Age' > 25:")
print(df[df['Age'] > 25])

Select 'Name' column:
0      Alice
1        Bob
2    Charlie
3      David
4     Edward
Name: Name, dtype: object

Select 'Name' and 'City' columns:
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston
4   Edward      Phoenix

Select row at index 2 using iloc:
Name      Charlie
Age            22
City      Chicago
Salary      45000
Name: 2, dtype: object

Select row with label 2 using loc:
Name      Charlie
Age            22
City      Chicago
Salary      45000
Name: 2, dtype: object

Filter rows where 'Age' > 25:
     Name  Age         City  Salary
1     Bob   27  Los Angeles   80000
3   David   32      Houston   60000
4  Edward   29      Phoenix   75000

##Aggregation##

In [7]:
import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Edward'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 45000, 60000, 75000]
}
df = pd.DataFrame(data)

# Print the DataFrame
print("DataFrame:")
print(df)

# Return the mean of the numerical values
print("\nMean of numerical columns:") # Changed the description to be more accurate
print(df.select_dtypes(include='number').mean()) # Select only numerical columns for mean calculation

# Return the sum of the values
print("\nSum:")
print(df.sum())

# Return the number of non-null observations
print("\nCount:")
print(df.count())

# Return the minimum of the values
print("\nMin:")
print(df.min())

# # Return the maximum of the values
# print("\nMax:")
# print(df.max())

# # Return the median of the values
# print("\nMedian:")
# print(df.median())

# # Return the standard deviation of the values
# print("\nStandard Deviation:")
# print(df.std())

# # Adding a new column 'Department'
# df['Department'] = ['HR', 'Finance', 'IT', 'HR', 'Finance']

# # Group by 'Department' and calculate mean for each group
# print("\nGroup by 'Department' and calculate mean:")
# grouped = df.groupby('Department').mean()
# print(grouped)

# # Creating a pivot table with 'Department' as index and 'City' as columns, and 'Salary' as values
# print("\nPivot Table (Department as index and City as columns):")
# pivot_table = df.pivot_table(values='Salary', index='Department', columns='City', aggfunc='mean')
# print(pivot_table)

DataFrame:
      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   45000
3    David   32      Houston   60000
4   Edward   29      Phoenix   75000

Mean of numerical columns:
Age          26.8
Salary    66000.0
dtype: float64

Sum:
Name                    AliceBobCharlieDavidEdward
Age                                            134
City      New YorkLos AngelesChicagoHoustonPhoenix
Salary                                      330000
dtype: object

Count:
Name      5
Age       5
City      5
Salary    5
dtype: int64

Min:
Name        Alice
Age            22
City      Chicago
Salary      45000
dtype: object

##Transformation##

In [8]:
# Sort by 'Age'
print("\nSorted by 'Age':")
sorted_by_age = df.sort_values(by='Age')
print(sorted_by_age)

# Sort by index
print("\nSorted by index:")
sorted_by_index = df.sort_index(ascending=False)
print(sorted_by_index)

# Rename 'Salary' to 'Income'
print("\nRename 'Salary' to 'Income':")
renamed_df = df.rename(columns={'Salary': 'Income'})
print(renamed_df)

# Apply a function to increment the 'Age' by 1
print("\nIncrement 'Age' by 1:")
increment_age = df['Age'].apply(lambda x: x + 1)
print(increment_age)

# Apply a function to convert all string data to uppercase
print("\nConvert string data to uppercase:")
uppercased_df = df[['Name', 'City']].applymap(lambda x: x.upper())
print(uppercased_df)

# Drop the 'City' column
print("\nDrop 'City' column:")
dropped_column_df = df.drop(columns=['City'])
print(dropped_column_df)

# Creating a DataFrame with missing values
data_with_nan = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', None],
    'Age': [24, None, 22, 32, 29],
    'City': ['New York', None, 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, None, 60000, 75000]
}
df_with_nan = pd.DataFrame(data_with_nan)

# Drop rows with missing values
print("\nDrop rows with missing values:")
dropped_na_df = df_with_nan.dropna()
print(dropped_na_df)

# Fill missing values with a specified value
print("\nFill missing values with specified value:")
filled_na_df = df_with_nan.fillna({'Age': df['Age'].mean(), 'Salary': df['Salary'].mean()})
print(filled_na_df)

Sorted by 'Age':
      Name  Age         City  Salary
2  Charlie   22      Chicago   45000
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
4   Edward   29      Phoenix   75000
3    David   32      Houston   60000

Sorted by index:
      Name  Age         City  Salary
4   Edward   29      Phoenix   75000
3    David   32      Houston   60000
2  Charlie   22      Chicago   45000
1      Bob   27  Los Angeles   80000
0    Alice   24     New York   70000

Rename 'Salary' to 'Income':
      Name  Age         City  Income
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   45000
3    David   32      Houston   60000
4   Edward   29      Phoenix   75000

Increment 'Age' by 1:
0    25
1    28
2    23
3    33
4    30
Name: Age, dtype: int64

Convert string data to uppercase:
      Name         City
0    ALICE     NEW YORK
1      BOB  LOS ANGELES
2  CHARLIE      CHICAGO
3    DAVID      HOUSTON
4   EDWARD      PHOENIX

Drop 'City' column:
      Name  Age  Salary
0    Alice   24   70000
1      Bob   27   80000
2  Charlie   22   45000
3    David   32   60000
4   Edward   29   75000

Drop rows with missing values:
    Name   Age      City   Salary
0  Alice  24.0  New York  70000.0
3  David  32.0   Houston  60000.0

Fill missing values with specified value:
      Name   Age      City   Salary
0    Alice  24.0  New York  70000.0
1      Bob  26.8      None  80000.0
2  Charlie  22.0   Chicago  66000.0
3    David  32.0   Houston  60000.0
4     None  29.0   Phoenix  75000.0

##Merging and Joining##

In [9]:
import pandas as pd

# Creating the first DataFrame
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32]
}
df1 = pd.DataFrame(data1)

# Creating the second DataFrame
data2 = {
    'ID': [3, 4, 5, 6],
    'City': ['Chicago', 'Houston', 'Phoenix', 'Los Angeles'],
    'Salary': [45000, 60000, 75000, 80000]
}
df2 = pd.DataFrame(data2)

# Creating the third DataFrame for join example
data3 = {
    'ID': [1, 2, 3, 4],
    'Department': ['HR', 'Finance', 'IT', 'HR']
}
df3 = pd.DataFrame(data3)

print("DataFrame 1:")
print(df1)

print("\nDataFrame 2:")
print(df2)

print("\nDataFrame 3:")
print(df3)

# Merge df1 and df2 on 'ID'
merged_df = pd.merge(df1, df2, on='ID')
print("\nMerged DataFrame (on 'ID'):")
print(merged_df)

# Concatenate df1 and df2 along rows
concatenated_df_rows = pd.concat([df1, df2], ignore_index=True)

DataFrame 1:
   ID     Name  Age
0   1    Alice   24
1   2      Bob   27
2   3  Charlie   22
3   4    David   32

DataFrame 2:
   ID         City  Salary
0   3      Chicago   45000
1   4      Houston   60000
2   5      Phoenix   75000
3   6  Los Angeles   80000

DataFrame 3:
   ID Department
0   1         HR
1   2    Finance
2   3         IT
3   4         HR

Merged DataFrame (on 'ID'):
   ID     Name  Age     City  Salary
0   3  Charlie   22  Chicago   45000
1   4    David   32  Houston   60000

##Reshaping##

In [10]:
# df.melt(): This function is used to unpivot a DataFrame from wide format to long format. It turns columns into rows, making the data longer and narrower.
# df.pivot(index, columns, values): This function reshapes data (produced by melt or another long format) back into a wide format. It converts rows into columns.
# df.stack(): This function stacks the prescribed level(s) from columns to index. It converts a wide DataFrame to a long one.
# df.unstack(): This function unstacks the prescribed level(s) from index to columns. It converts a long DataFrame to a wide one.
import pandas as pd

data = {
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [90, 80, 70],
    'Science': [85, 75, 65]
}

df = pd.DataFrame(data)
print(df)
melted_df = pd.melt(df, id_vars=['ID', 'Name'], value_vars=['Math', 'Science'], var_name='Subject', value_name='Score')
print(melted_df)
pivoted_df = melted_df.pivot(index='ID', columns='Subject', values='Score').reset_index()
print(pivoted_df)
stacked_df = df.set_index(['ID', 'Name']).stack().reset_index(name='Score')
stacked_df.columns = ['ID', 'Name', 'Subject', 'Score']
print(stacked_df)
stacked_df = df.set_index(['ID', 'Name']).stack().reset_index(name='Score')
stacked_df.columns = ['ID', 'Name', 'Subject', 'Score']
unstacked_df = stacked_df.set_index(['ID', 'Name', 'Subject']).unstack().reset_index()
unstacked_df.columns = ['ID', 'Name', 'Math', 'Science']
print(unstacked_df)

   ID     Name  Math  Science
0   1    Alice    90       85
1   2      Bob    80       75
2   3  Charlie    70       65
   ID     Name  Subject  Score
0   1    Alice     Math     90
1   2      Bob     Math     80
2   3  Charlie     Math     70
3   1    Alice  Science     85
4   2      Bob  Science     75
5   3  Charlie  Science     65
Subject  ID  Math  Science
0         1    90       85
1         2    80       75
2         3    70       65
   ID     Name  Subject  Score
0   1    Alice     Math     90
1   1    Alice  Science     85
2   2      Bob     Math     80
3   2      Bob  Science     75
4   3  Charlie     Math     70
5   3  Charlie  Science     65
   ID     Name  Math  Science
0   1    Alice    90       85
1   2      Bob    80       75
2   3  Charlie    70       65

##Input and Output##

In [ ]:

# df.to_csv(filepath): Write DataFrame to a CSV file.
# df.to_excel(filepath): Write DataFrame to an Excel file.
# df.to_json(filepath): Write DataFrame to a JSON file.
# df.to_sql(table_name, con): Write records stored in a DataFrame to a SQL database.